#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```local_sensitive_file.azmi1-tf-private-key: Refreshing state... [id=facaddcd0da6873a54847c17b2a327cc6713357f]
tls_private_key.azmi1-tf-tls: Refreshing state... [id=e17fcc0bc2ea58744492162c612bfceb530801a5]
data.aws_security_group.vpc_sg_data: Reading...
module.ec2_instance.data.aws_partition.current: Reading...
data.aws_subnet.public_subnet_data: Reading...
data.aws_ami.aws_ami_data: Reading...
aws_ecr_repository.ecr_repo: Refreshing state... [id=azmi1-nodejs-app]
aws_key_pair.azmi1-tf-keypair: Refreshing state... [id=azmi1-tf-keypair]
module.ec2_instance.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_security_group.vpc_sg_data: Read complete after 0s [id=sg-0d6bfc561f5620e5f]
data.aws_subnet.public_subnet_data: Read complete after 0s [id=subnet-076c22fe216f37497]
data.aws_ami.aws_ami_data: Read complete after 0s [id=ami-0fff1b9a61dec8a5f]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0d5eb905abb1fb3d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_key_pair.azmi1-tf-keypair will be destroyed
  # (because aws_key_pair.azmi1-tf-keypair is not in configuration)
  - resource "aws_key_pair" "azmi1-tf-keypair" {
      - arn             = "arn:aws:ec2:us-east-1:255945442255:key-pair/azmi1-tf-keypair" -> null
      - fingerprint     = "0c:8a:b4:32:85:46:ee:b5:c0:b4:da:26:84:de:61:e7" -> null
      - id              = "azmi1-tf-keypair" -> null
      - key_name        = "azmi1-tf-keypair" -> null
      - key_pair_id     = "key-0d28e33555d9d20aa" -> null
      - key_type        = "rsa" -> null
      - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8etP/CRIsxcjBT+CrazFdc94cSplgqPOsShiNqG5DqTxcTfvUpYhPN1dgD9TC68oXyUQ8L45B9Qe1TbPV8vP0NQG7ZxLXTnkPuLAKJjc1xMno1JHE+S65wtOTjC3TBwveu+ncJwgsPXw00to/fe1YHpvePw1xZ4jklhD3Ttzuma+DQKn4fFl6zVkFOGXT+/6UbyRRIxyBMKGu5xDEhnmeutIkYMLIOmDCJ1UwxCSFVOZd50MGJwTG74/npSIrTbW/VcFkcK25iDKMgnX5B3nL2WHp5BTO2he6KUbiJNJJtq9fnJDIP5oSaadHBi4T3vqGSUM85PFhoRzKg9SmSy7/DJg268z71jOtV1tGgwwCrsbE7qC6Ac3dhJsv2eyKF4rVBPeUOOhl/ViMTNzC7a0qo7zm9UrclmlM+lrl1hZb/skTq0/I9yrMPJjgqomfUTuGj+Ut7f1+1lzPQ09FYgL58RfCHoSIM6AtgQpODb9hsB++R81uDr09QqcZrt3noyskq+qLKoojfrhu/8OmOSvYV+WxvPVzjYVWubP3yU3F8M3GLPyO2k/uzr/Fc2HUOAD8vhJSqPQ5Yxf8lHNH2vahFa0fIdL0r04L4b4oDkITBb6+gYXx+J0AqTp8jJXxKrpImpI6kSx9WQjuLHGk4LNRoli0HS+OJYTsD1T0n/+6GQ==" -> null
      - tags_all        = {} -> null
        # (1 unchanged attribute hidden)
    }

  # tls_private_key.azmi1-tf-tls will be destroyed
  # (because tls_private_key.azmi1-tf-tls is not in configuration)
  - resource "tls_private_key" "azmi1-tf-tls" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "e17fcc0bc2ea58744492162c612bfceb530801a5" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "bf:bf:59:36:3f:dc:89:db:43:3d:fa:f3:8e:fd:64:e3" -> null
      - public_key_fingerprint_sha256 = "SHA256:wXDFb68fn0FFWNzztDgz8s7FXMBqOfj7ycaxUV1+eQM" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8etP/CRIsxcjBT+CrazFdc94cSplgqPOsShiNqG5DqTxcTfvUpYhPN1dgD9TC68oXyUQ8L45B9Qe1TbPV8vP0NQG7ZxLXTnkPuLAKJjc1xMno1JHE+S65wtOTjC3TBwveu+ncJwgsPXw00to/fe1YHpvePw1xZ4jklhD3Ttzuma+DQKn4fFl6zVkFOGXT+/6UbyRRIxyBMKGu5xDEhnmeutIkYMLIOmDCJ1UwxCSFVOZd50MGJwTG74/npSIrTbW/VcFkcK25iDKMgnX5B3nL2WHp5BTO2he6KUbiJNJJtq9fnJDIP5oSaadHBi4T3vqGSUM85PFhoRzKg9SmSy7/DJg268z71jOtV1tGgwwCrsbE7qC6Ac3dhJsv2eyKF4rVBPeUOOhl/ViMTNzC7a0qo7zm9UrclmlM+lrl1hZb/skTq0/I9yrMPJjgqomfUTuGj+Ut7f1+1lzPQ09FYgL58RfCHoSIM6AtgQpODb9hsB++R81uDr09QqcZrt3noyskq+qLKoojfrhu/8OmOSvYV+WxvPVzjYVWubP3yU3F8M3GLPyO2k/uzr/Fc2HUOAD8vhJSqPQ5Yxf8lHNH2vahFa0fIdL0r04L4b4oDkITBb6+gYXx+J0AqTp8jJXxKrpImpI6kSx9WQjuLHGk4LNRoli0HS+OJYTsD1T0n/+6GQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAvHrT/wkSLMXIwU/gq2sx
            XXPeHEqZYKjzrEoYjahuQ6k8XE371KWITzdXYA/UwuvKF8lEPC+OQfUHtU2z1fLz
            9DUBu2cS1055D7iwCiY3NcTJ6NSRxPkuucLTk4wt0wcL3rvp3CcILD18NNLaP33t
            WB6b3j8NcWeI5JYQ907c7pmvg0Cp+HxZes1ZBThl0/v+lG8kUSMcgTChrucQxIZ5
            nrrSJGDCyDpgwidVMMQkhVTmXedDBicExu+P56UiK021v1XBZHCtuYgyjIJ1+Qd5
            y9lh6eQUztoXuilG4iTSSbavX5yQyD+aEmmnRwYuE976hklDPOTxYaEcyoPUpksu
            /wyYNuvM+9YzrVdbRoMMAq7GxO6gugHN3YSbL9nsiheK1QT3lDjoZf1YjEzcwu2t
            KqO85vVK3JZpTPpa5dYWW/7JE6tPyPcqzDyY4KqJn1E7ho/lLe39ftZcz0NPRWIC
            +fEXwh6EiDOgLYEKTg2/YbAfvkfNbg69PUKnGa7d56MrJKvqiyqKI364bv/Dpjkr
            2Fflsbz1c42FVrmz98lNxfDNxiz8jtpP7s6/xXNh1DgA/L4SUqj0OWMX/JRzR9r2
            oRWtHyHS9K9OC+G+KA5CEwW+voGF8fidAKk6fIyV8Sq6SJqSOpEsfVkI7ixxpOCz
            UaJYtB0vjiWE7A9U9J//uhkCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

  # module.ec2_instance.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:255945442255:instance/i-0d5eb905abb1fb3d1" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0d5eb905abb1fb3d1" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "azmi1-tf-keypair" -> "azmi1-keypair-useast1" # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-093839e48c53db9dd" -> (known after apply)
      ~ private_dns                          = "ip-10-0-101-189.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.101.189" -> (known after apply)
      ~ public_dns                           = "ec2-98-80-134-175.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "98.80.134.175" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "azmi1-nodejs-ec2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0947e9ead64789514" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Warning: Missing resource schema from provider

No resource schema found for local_sensitive_file when decoding prior state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @RaytraceSG, Action: `pull_request`, Workflow: `Terraform Checks`*